app/views/book_comments/_comment.html.erb

<table>
  <% book.book_comments.each do |comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]