app/views/books/show.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          <td class="favorite-btn-<%= @book.id %>"><%= render "favorites/favorite-btn", book: @book %></td>
          <td>コメント数: <%= @book.book_comments.count %></td>